@analytically I wasn't able to reproduce the error you have in version 3.6.0
#### Terraform Configuration Files
In `main.tf`
```hcl
provider "okta" {}

resource "okta_app_oauth" "testapp2" {
  label = "testapp2"
  type = "browser"
  grant_types = [
    "authorization_code",
    "implicit"]
  redirect_uris = [
    "http://localhost:3000"
  ]
  response_types = [
    "token",
    "id_token",
    "code"]
  omit_secret = true
  token_endpoint_auth_method = "none"
}
```

In `versions.tf`
```hcl
terraform {
  required_providers {
    okta = {
      source = "oktadeveloper/okta"
      version = "~> 3.6"
    }
  }
  required_version = ">= 0.13"
}
```

#### Steps to reproduce

```bash
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_app_oauth.testapp2 will be created
  + resource "okta_app_oauth" "testapp2" {
      + auto_key_rotation          = true
      + auto_submit_toolbar        = false
      + client_id                  = (known after apply)
      + client_secret              = (sensitive value)
      + consent_method             = "TRUSTED"
      + grant_types                = [
          + "authorization_code",
          + "implicit",
        ]
      + hide_ios                   = true
      + hide_web                   = true
      + id                         = (known after apply)
      + issuer_mode                = "ORG_URL"
      + label                      = "testapp2"
      + name                       = (known after apply)
      + omit_secret                = true
      + redirect_uris              = [
          + "http://localhost:3000",
        ]
      + response_types             = [
          + "code",
          + "id_token",
          + "token",
        ]
      + sign_on_mode               = (known after apply)
      + status                     = "ACTIVE"
      + token_endpoint_auth_method = "none"
      + type                       = "browser"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

okta_app_oauth.testapp2: Creating...
okta_app_oauth.testapp2: Creation complete after 5s [id=0oausr38prJsG2RyI0h7]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ terraform apply

okta_app_oauth.testapp2: Refreshing state... [id=0oausr38prJsG2RyI0h7]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```

Try running `terraform init` to install the latest version of the provider